
蒂雷纳子爵——亨利·德·拉图尔·奥弗涅又译为杜伦尼（法语：Henri de La Tour d'Auvergne, Viscount of Turenne，1611年9月11日－1675年7月27日）\
拿破仑指名的七位best of best 中唯一的法国人\
由马扎然提拔为法国元帅（六大法国大元帅（Marshal General of France）之一），在他的指挥下大败神圣罗马帝国军队，并签订了威斯特伐利亚和约，结束了德意志三十年战争
第二次投石党之乱中，作为孔代支持者的蒂雷纳逃亡荷兰，跟法国的敌人西班牙合作，带领一支西班牙军队进攻法国。但他被法国保王派的杜普莱西斯公爵(Duplessis)将军在1650年于Champ Blanc战役击败
1651年，马萨林去职，孔代被释放，蒂雷纳也回到法国，决定成为忠实的保王党大将

路易二世·德·波旁，第四代孔代亲王（法语：Louis II de Bourbon，4me prince de Condé，1621年9月8日－1686年11月11日）\
即“大孔代”，而且这个大，并非单纯区分同名人物，而指“伟大”称号\
1643年5月19日，路易在罗克鲁瓦战役中获胜，此时，他年仅23岁，且对手是当时称霸欧洲的西班牙陆军。在此之后的5年，被称为5年奇迹，1643年至1649年他领导的法军未尝败绩，
在三十年战争后，他实际上成为法国贵族派的领袖\
随后发生了投石党运动，这场运动非常混乱，孔代一开始站在皇室一边，领军围攻叛乱的巴黎终结了第一次投石党战争\
随后，他与王室和马萨林决裂，在安娜太后的授意之下，1650年1月18日马萨林政府逮捕了路易二世·德·波旁及他的主要追随者孔蒂亲王（路易的弟弟）和隆格维尔公爵。孔代的其他支持者，包括蒂雷纳等人成功出逃\
1651年1月，奥地利的安娜释放了被关押在勒阿弗尔的孔代等三人。孔代获释后即与西班牙结盟向宫廷和马萨林挑战。\
王室和前法院福隆德成员被迫联合反对孔代，混乱的内战开始。\
1652年7月2日在巴黎圣安托万区，与蒂雷纳作战，苦战险胜\
1658年6月14日在敦克尔克附近，孔代被蒂雷纳彻底击溃\
于1659年比利牛斯和约中，孔代获得了已经亲政的堂弟路易十四的宽恕，于是他又开始为法国效力了。\
之后，与蒂雷纳联手 南征北战，军势无挡\

克洛德·路易·赫克托尔·德·维拉尔克洛德·路易·赫克托尔·德·维拉尔，马蒂格亲王，维拉尔公爵和侯爵和默伦子爵（Claude Louis Hector de Villars, Prince de Martigues, Marquis and Duc de Villars and Vicomte de Melun，1653年5月8日－1734年6月17日）
十八世纪欧洲三大将军之一\
多次击败欧根亲王\


弗朗索瓦·米歇尔·勒泰利埃，卢福瓦侯爵（法语：François Michel Le Tellier, Marquis de Louvois，1641年1月18日－1691年7月16日）
担任陆军国务大臣（……他是柯尔贝的政敌，o军马鹿！）
（1661年）法国军队仅仅拥有人数不到5万而且素质良莠不齐的陆军。卢福瓦上台后迅速改善法国军队的状况，逐步增兵到1670年代的12.5万步兵与4.7万骑兵，甚至到1680年以后的大战时期，都能维持30万以上的法军
他和法国大革命期间的拉札尔·卡诺并列为法国历史上最伟大的军备组织天才。

拉扎尔·尼古拉·玛格丽特·卡诺（Lazare Nicolas Marguerite Carnot，1753年5月13日－1823年8月2日）
甚至是个数学家
他在法国大革命战争中获得伟大的名号——“组织胜利的人”
长子尼古拉·卡诺为热力学之父及热机理论之建构者（卡诺循环）
